[
  {
    "id": "fresh-pasta",
    "title": "How to make fresh pasta",
    "date": "",
    "hardsrc": "fresh-pasta.jpg",
    "ingredients": [
      "1 ¾ cups flour", "3 eggs", "salt"
    ],
    "blurbs": [
      {
        "imageUrl": "fresh-pasta.jpg",
        "text": "Start by putting all the flour and pinch of salt into a bowl (I use all-purpose, you can also use bread flour). Make a well in the middle, and lightly beat 2 eggs and 1 egg yolk with a fork and then plop them in the middle. Start mixing together with your hands or a fork until it starts to come together enough to move to a countertop."
      },
      {
      "text": "Next, lightly flour the countertop and start kneading in a downward motion (smush the dough onto the counter, away from you, then fold it over back on top of itself and repeat for 10 minutes, or until it is glossy on the outside. Note: if the mixture is a little too soft and sticky, add a bit of flour until it is manageable with your hands, conversely if it is too stiff or crumbly, add a bit of water on your hands and then knead it in."
      },
      {
      "text": "After it is smooth on the outside, form the dough into a ball, cover in plastic wrap, and leave to rest at room temp for at least 1 hour."
      },
      {
      "text": "Roll out on the counter, lightly dusting with flour when needed (as thin as you can get it), or use a pasta machine or attachment starting from the widest setting, and working your way down. You will want to pass it through the widest setting multiple times and then work your way down, also it is helpful to cut the dough in half to manage it better (keep the rest covered as you work with it). Once you have finished rolling your dough and have thin sheets of pasta, you can keep them thick for lasagna, cut them into ravioli shapes, or use a fettuccine or linguine attachment (or knife) to cut them into the right shapes."
      },
      {
      "text": "Once you have cut the pasta, I like to hang it as I go on clothes hangers or a clothing rack to ensure they do not stick to each other. Fresh pasta is best eaten fresh, so right into the pot after making (and only a ~2-5 min cooking time), but if you do want to cook it later, you can flash cook it for 30 seconds, drain, toss in some olive oil, and then store it in the fridge or freezer."
      }
    ]
  },
  {
    "id": "basic-pasta-sauce",
    "title": "Basic pasta sauce",
    "date": "",
    "hardsrc": "basic-pasta-sauce.jpg",
    "ingredients": [
      "1 can tomatoes (~28oz)", "2 tbsp olive oil", "5 cloves garlic", "10 leaves of basil", "large pinch of sugar", "pinch of salt"
    ],
    "blurbs": [
      {
        "text": "Very simple tomato sauce recipe. Easy to make, and done in under an hour!"
      },
      {
        "imageUrl": "basic-pasta-sauce-tomatoes.jpg",
        "title": "Prep ingredients",
        "text": "I like to prep everything first: peel garlic, and leave whole, get basil leaves out (also whole) and get canned tomatoes ready. For the canned tomatoes, I love crushed or diced tomatoes to retain some flavor, and it is worth spending a little more to get good quality tomatoes. I use and recommend San Marzano."
      },
      {
        "imageUrl": "basic-pasta-sauce-saute.jpg",
        "title": "Sauté garlic",
        "text": "First step is to get a medium sized pot and heat it on medium heat. Add two tablespoons of olive oil and whole garlic cloves. The goal is not to brown them in any way, but only to infuse the oil with garlic flavor before adding the sauce. This should take less than a minute from when garlic starts to simmer.",
        "imagePosition": "left"
      },
      {
        "imageUrl": "basic-pasta-sauce.jpg",
        "title": "Add tomatoes and basil",
        "text": "Pour in the whole can of tomato sauce, a large pinch of sugar, a pinch of salt, as well as the basil leaves. I also sometimes put the entire stem of the basil in as well (it is easier to remove at the end if unwanted in the final sauce). Give it a stir, then let simmer on low for at least 40 minutes. You can tell when the sauce is done when the garlic cloves are able to be smashed against the side of the pan with a wooden spoon. Repeat for all cloves, and stir in the garlicky goodness!"
      },
      {
        "text": "This sauce is best used after it has sat for a little bit, but can be served immediately, or canned for future use."
      }
    ]
  },
  {
    "id": "birthday-cake",
    "title": "Birthday Cake",
    "date": "",
    "hardsrc": "birthday-cake.jpg",
    "blurbs": [
      {
        "text": "Recipe coming soon!"
      }
    ]
  },
  {
    "id": "uovo-alla-coque",
    "title": "Uovo alla coque",
    "date": "",
    "hardsrc": "uovo-alla-coque.jpg",
    "ingredients": [
      "eggs", "water", "pinch of salt"
    ],
    "blurbs": [
      {
        "imageUrl": "uovo-alla-coque.jpg",
        "title": "Soft boiled eggs",
        "text": "Bring water to a boil in a pot that generously fits all of the eggs you wish to use. Once it boils, gently place eggs (directly from the fridge) in for 6 minutes. Take out and place in ice water to cool quickly."
      },
      {
        "text": "Enjoy in your favorite egg holder with a pinch of salt, or for some fun, marinate overnight (e.g. with soy sauce mixture) for some flavorful jammy eggs good in any soup or side!"
      }
    ]
  },
  {
    "id": "braised-short-ribs",
    "title": "Braised short ribs",
    "date": "",
    "hardsrc": "braised-short-ribs.jpg",
    "ingredients": [
      "2 ½ lbs short ribs, cut into pieces", "salt", "2 dried medium-spiece chiles (e.g. guajillo or ancho)", "1 onion (really any kind is fine), sliced crosswise into rounds", "5 whole garlic cloves", "1 tsp red pepper flakes", "1 tsp ground coriander" , "1 tsp ground cumin", "½ tsp ground cinnamon", "3 tbsp vegetable oil", "2 tbsp tomato paste", "½ acorn squash (~1 lb) sliced into wedges", "Plain whole-milk Greek yogurt or sour cream", "lime wedges", "cilantro (optional)"
    ],
    "blurbs": [
      {
        "imageUrl": "braised-short-ribs.jpg",
        "title": "Prepare the ribs",
        "text": "Generously salt the ribs, and leave at room temperature for 1 hour, you can also leave uncovered overnight in the fridge, and then leave at room temp for 1 hour before cooking."
      },
      {
        "title": "Prepare the sauce",
        "text": "Add 5 cups hot water to blender with chiles. Set aside. Chop onion into rounds and place it and the whole garlic in the oven to broil for 10 minutes, or until medium charred. Remove garlic skins and place in blender with onion, cumin, coriander, red pepper flakes, cinnamon, and pinch of salt. Blend until smooth."
      },
      {
        "title": "Combine and cook the ribs",
        "text": "Pour 2 tbsp olive oil into a big pot (I used a cast iron) over medium-high. Cook the meat on all sides until nicely browned a couple of minutes each side, without overcrowding the pot (it might take 2-3 batches depending on the size of your pot). Move to a plate. Clean the pot and add 1 tbsp clean oil to pan over medium-high heat. Add tomato paste and sweat it out for a couple of minutes, stirring frequently. Pour in the chile mixture, and add meat. Return to a boil, and then turn the heat down to low so it just barely simmers. Put lid on with some room for steam to escape and leave for 3-3.5 hours. You can occasionally skim fat off the top and discard, and turn the ribs so they are flavored and cook evenly. Add the slices of acorn squash to the pot and cook for another 20 minutes. If the liquid is not thick enough, you can reduce just the liquid after everything is cooked."
      },
      {
        "title": "Enjoy!",
        "text": "Serve with yogurt, lime wedges, and cilantro (optional)."
      },
      {
        "text": "This recipe was taken from: https://www.bonappetit.com/recipe/braised-short-ribs-with-squash-and-chile."
      }
    ]
  },
  {
    "id": "fruit-tart",
    "title": "Fruit tart",
    "date": "05-26-2020",
    "hardsrc": "fruit-tart.jpg",
    "ingredients": [
      "1 stick unsalted butter, softened", "1 cup sugar", "5 eggs", "2 ¼ cups flour", "salt", "¼ cup flour", "2 ¼ cup whole milk" , "1 tsp vanilla", "fresh fruit of your choice (I recommend raspberries, sliced strawberries, and blueberries) "     ],
     "blurbs": [
      {
        "imageUrl": "fruit-tart-assembly.jpg",
        "title": "Prepare the tart shell",
        "text": "Mix 1 stick butter with a little under ½ cup sugar, and a pinch of salt with a mixer or a whisk until it lightens in color and is fluffier (shouldn’t take longer than 1 min). Next, lightly beat 1 egg, and plop that in with 2 ¼ cups flour. Mix with utensil or hands until it all comes together and is uniform. Shape the dough into a square about 1” thick, and cut into 4 pieces. Stack them on top of each other and enjoy while you squish them down. Repeat. Next put it back into a ball or the square shape, wrap in plastic wrap, and chill in the fridge for 1 hour."
      },
      {
        "imageUrl": "fruit-tart-slice.jpg",
        "title": "Prepare the custard",
        "text": "While the tart dough is resting, you can prepare the custard. Beat 4 egg yolks with ½ cup of sugar in a bowl until pale and fluffy (with whisk or mixer), add ¼ cup flour a little at a time until uniform. Set aside. Heat 2 ¼ cup milk until it comes to a boil (careful not to have it burn at the bottom of the pan (mine did and I had to clean the pot). When it is just boiling, take off the heat, and slowly add it back to the egg yolk mixture stirring it in gradually. Then, assuming you don’t need to wash your milk pan, put the entire mixture back in the pot, and place it over low/medium heat stirring continuously until it thickens (be patient, it might take a little, if it is bubbling the stove is too high). Once thickened, pour into a bowl and stir while it cools (to not have a “crust” form on top), and then place into the fridge with plastic wrap on top to prevent forming a crust."
      },
      {
        "title": "Roll out and bake the tart",
        "text": "Preheat the oven to 350. Take the tart crust out of the fridge, roll into a ¼ thick circle, and place in a 9” pie/ cake pan (or tart pan if you’re fancy). Put pie weights or dried beans on top of parchment paper cut to the pie size inside to keep the dough from rising, if you don’t have that, puncture the bottom multiple times with a fork. Place in the oven for about 25-30 minutes. Let cool completely."
      },
      {
        "imageUrl": "fruit-tart.jpg",
        "title": "Avengers assemble!",
        "text": "Place the custard in the cooled tart shell, smooth out the top, then place fresh fruit in whatever arrangement suits your fancy. Can be eaten right after making, but for some extra flavor mixing, best eaten the next day. Store in fridge overnight."
      },
      {
        "text": "These recipes were taken from “The Silver Spoon” cookbook, second edition, in English (2018)."
      }
    ]
  }
]
